# SharedCoordinatesFailures Properties

---
The BuiltInFailuresSharedCoordinatesFailures type exposes the following members.
| Name| Description
---|---|---
| CannotAcquireCoordinatesFromLinkWithScaledLocation|  Can't acquire coordiantes from a link that has a scaled location.
| CannotAcquireCoordinatesFromScaledLink|  Can't acquire coordinates from a link that is scaled.
Top
#### Reference
BuiltInFailuresSharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace